Documents/ЗакрытиеТП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ЗакрытиеТП</Name>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.ЗакрытиеПоСотрудникам</xr:Item>
				<xr:Item>AccumulationRegister.ПланТиражныхРабот</xr:Item>
				<xr:Item>AccumulationRegister.ОстаткиТирАиП</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Проект</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроектыТиражные</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>МесяцНачисления</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>Date</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ПланРабот</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРаботТиражный</v8:Type>
						<v8:Type>cfg:DocumentRef.ПланРабот</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Закрытие</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Дата</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ФизическоеЛицо</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

AccumulationRegisters/ОстаткиТирАиП.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<AccumulationRegister>
		<Properties>
			<Name>ОстаткиТирАиП</Name>
			<RegisterType>Balance</RegisterType>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Сумма</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Attribute>
				<Properties>
					<Name>Договор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Проекты</v8:Type>
						<v8:Type>cfg:DocumentRef.Договор</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Dimension>
				<Properties>
					<Name>Источник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ПроектыТиражные</v8:Type>
						<v8:Type>cfg:DocumentRef.АктТиражногоПодразделения</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ПланРабот</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ПланРаботТиражный</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</AccumulationRegister>
</MetaDataObject>

Documents/ПланРаботТиражный.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.5">
	<Document>
		<Properties>
			<Name>ПланРаботТиражный</Name>
			<BasedOn>
				<xr:Item>Catalog.ЗадачиПроектов</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
			<RegisterRecords>
				<xr:Item>AccumulationRegister.БюджетПоМесяцам</xr:Item>
				<xr:Item>AccumulationRegister.ПланТиражныхРабот</xr:Item>
				<xr:Item>AccumulationRegister.ФронтРабот</xr:Item>
			</RegisterRecords>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаПроекта</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ЗадачиПроектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсполнительДокумента</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ОстатокПоСмете</Name>
					<Comment>Разница между суммой по смете и суммой плана работ</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Закрыт</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СкидкаКлиенту</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>15</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТребуетсяПодтверждение</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Расчет</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Номенклатура</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Месяц</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>Date</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Количество</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>4</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Цена</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Содержание</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЦенаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СуммаФОТ</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Скидка</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Documents/ЗакрытиеТП/Forms/ФормаДокумента/Ext/Form/Module.bsl
&НаСервере
Процедура ПриИзмененииТиражногоПроекта()
	МоментВремени = ?(Объект.Ссылка.Пустая(), ТекущаяДата(), Объект.Ссылка.МоментВремени()) ;

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	СУММА(ОстаткиЛимитаТПОстатки.СуммаОстаток) КАК СуммаОстаток
		|ИЗ
		|	РегистрНакопления.ОстаткиТирАиП.Остатки(
		|			&МоментВремени,
		|			Источник = &Проект
		|				И ПланРабот = &ПланРабот) КАК ОстаткиЛимитаТПОстатки";

	Запрос.УстановитьПараметр("МоментВремени", 	МоментВремени);
	Запрос.УстановитьПараметр("Проект", 		Объект.Проект);
	Запрос.УстановитьПараметр("ПланРабот", 		Объект.ПланРабот);

	Результат = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = Результат.Выбрать();

	ОстатокЛимитаТиражногоПроекта = 0;
	Пока ВыборкаДетальныеЗаписи.Следующий() Цикл
		ОстатокЛимитаТиражногоПроекта = ВыборкаДетальныеЗаписи.СуммаОстаток;
	КонецЦикла;

	// устанавливаем по умлочанию
	Попытка 
		Объект.ПланРабот = Объект.Проект.ПланРабот;
	Исключение
		Сообщение = Новый СообщениеПользователю;
		Сообщение.Текст = ОписаниеОшибки();
		Сообщение.Сообщить();
	КонецПопытки;
	
Конецпроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если НЕ ЗначениеЗаполнено( Объект.МесяцНачисления ) Тогда
		Объект.МесяцНачисления = НачалоМесяца(ТекущаяДата());
	КонецЕсли;
КонецПроцедуры

&НаКлиенте
Процедура ТиражныйПроектПриИзменении(Элемент)
	ПриИзмененииТиражногоПроекта();
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
КонецПроцедуры

&НаКлиенте
Процедура МесяцНачисленияПриИзменении(Элемент)
	Объект.МесяцНачисления = НачалоМесяца( Объект.МесяцНачисления );
КонецПроцедуры

&НаКлиенте
Процедура ДатаПриИзменении(Элемент)
	Объект.МесяцНачисления = НачалоМесяца( ДобавитьМесяц( НачалоМесяца(Объект.Дата), -1 ));
КонецПроцедуры

//&НаСервереБезКонтекста
//Функция МасиивПлановРабот(ТиражныйПроект)
//	Возврат ПланыРаботПоПроектам.СписокПлановРаботПоПодразделению( ТиражныйПроект.Подразделение );
//КонецФункции

&НаСервереБезКонтекста
Функция ПодразделениеТП( Проект )
	Возврат Проект.Подразделение;
КонецФункции


&НаКлиенте
Процедура ПланРаботНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Если ТипЗнч( Объект.ПланРабот ) = Тип( "ДокументСсылка.ПланРаботТиражный") Тогда
		//
		ПараметрыПР = Новый Структура;
		ПараметрыПР.Вставить("Подразделение", ПодразделениеТП( Объект.Проект) );
		
		ФормаВыбора 	= ПолучитьФорму( "Документ.ПланРаботТиражный.Форма.ФормаВыбораДляПодразделения", ПараметрыПР, Элемент );
		ФормаВыбора.Открыть();
		СтандартнаяОбработка = Ложь;
		
	КонецЕсли;
	//
	//мПР =  МасиивПлановРабот( Объект.ТиражныйПроект );
	//Если мПР.Количество() <> 0  Тогда
	//	Элементы.ПланРабот.РежимВыбораИзСписка = Истина;
	//	Элементы.ПланРабот.СписокВыбора.ЗагрузитьЗначения( мПР );
	//Иначе
	//	СтандартнаяОбработка = Ложь;
	//КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура ЗакрытиеНоменклатураНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	мНоменклатуры = мНоменклатуры( Объект.ПланРабот );
	Если мНоменклатуры <>  Неопределено Тогда
		ЭтаФорма.Элементы.ЗакрытиеНоменклатура.РежимВыбораИзСписка	=	Истина;
		ЭтаФорма.Элементы.ЗакрытиеНоменклатура.СписокВыбора.ЗагрузитьЗначения(мНоменклатуры);
	КонецЕсли;
КонецПроцедуры

&НаСервереБезКонтекста
Функция мНоменклатуры( ПланРаботТиражный )
	Возврат УП_ПланыРаботПоПроектам.МассивНоменклатурыИзПланаРаботТиражного( ПланРаботТиражный );
КонецФункции

&НаСервереБезКонтекста
Функция мЦен( ПланРаботТиражный, Номенклатура, НазваниеЦены )
	тзЦены 	= УП_ПланыРаботПоПроектам.ПолучитьЦеныНоменклатурыИзПланаРабот(ПланРаботТиражный, Номенклатура );
	мЦен	=  тзЦены.ВыгрузитьКолонку( НазваниеЦены );
	Возврат мЦен;
КонецФункции


&НаКлиенте
Процедура ПересчетСуммПоСтроке( Стр )
	// 
	Стр.Сумма 		= Стр.Количество * Стр.Цена - Стр.Скидка;
	// пропорция цены
	Если Стр.Цена <> 0 Тогда
		К = Стр.Сумма/Стр.Цена;
		// пересчет суммы
		Стр.СуммаФОТ 	= К * Стр.ЦенаФОТ;
	Иначе
		Стр.СуммаФОТ 	= Стр.Количество  * Стр.ЦенаФОТ;
	КонецЕсли;
КонецПроцедуры

// максимальная цена номенклатуры
&НаСервереБезКонтекста
Функция ПолучитьМаксЦенуИзПланаРабот( ПланРаботТиражный, Номенклатура )
	СтЦен = Новый Структура;
	тзЦены = УП_ПланыРаботПоПроектам.ПолучитьЦеныНоменклатурыИзПланаРабот(ПланРаботТиражный, Номенклатура );
	Если тзЦены.Количество() <> 0 Тогда
		СтЦен.Вставить("Цена", 		тзЦены[0].Цена);
		СтЦен.Вставить("ЦенаФОТ", 	тзЦены[0].ЦенаФОТ);
	Иначе
		СтЦен.Вставить("Цена", 		0);
		СтЦен.Вставить("ЦенаФОТ", 	0);
	КонецЕсли;
	Возврат СтЦен;
КонецФункции


&НаКлиенте
Процедура ЗакрытиеНоменклатураПриИзменении(Элемент)
	Перем ЦенаФОТ, Цена;
	Стр = Элементы.Закрытие.ТекущиеДанные;
	Если ЗначениеЗаполнено(Стр.Номенклатура) Тогда
	
		СтЦен 		= ПолучитьМаксЦенуИзПланаРабот( Объект.ПланРабот, Стр.Номенклатура );
		Стр.ЦенаФОТ = СтЦен.ЦенаФОТ;
		Стр.Цена    = СтЦен.Цена;	
		
	Иначе
		Стр.ЦенаФОТ = 0;
		Стр.Цена    = 0;	
	КонецЕсли;
	ПересчетСуммПоСтроке( Стр );

КонецПроцедуры

//&НаКлиенте
//Процедура ЗакрытиеКоличествоПриИзменении(Элемент)
//	Стр = Элементы.Закрытие.ТекущиеДанные;
//	ПересчетСуммПоСтроке( Стр );
//КонецПроцедуры


&НаКлиенте
Процедура ПланРаботПриИзменении(Элемент)
	Для Каждого Стр ИЗ Объект.Закрытие Цикл
		Стр.Номенклатура = Неопределено;
	КонецЦикла;
КонецПроцедуры


//&НаКлиенте
//Процедура ЗакрытиеСкидкаПриИзменении(Элемент)
//	Стр = Элементы.Закрытие.ТекущиеДанные;
//	ПересчетСуммПоСтроке( Стр );
//	
//КонецПроцедуры


&НаКлиенте
Процедура ЗакрытиеЦенаНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Стр = Элементы.Закрытие.ТекущиеДанные;
	
	мЦен  = мЦен( Объект.ПланРабот,  Стр.Номенклатура, "Цена" );
	Если мЦен <>  Неопределено Тогда
		ЭтаФорма.Элементы.ЗакрытиеЦена.РежимВыбораИзСписка	=	Истина;
		ЭтаФорма.Элементы.ЗакрытиеЦена.СписокВыбора.ЗагрузитьЗначения(мЦен);
	КонецЕсли;
КонецПроцедуры


//&НаКлиенте
//Процедура ЗакрытиеЦенаПриИзменении(Элемент)
//	Стр = Элементы.Закрытие.ТекущиеДанные;
//	ПересчетСуммПоСтроке( Стр );
//КонецПроцедуры


&НаКлиенте
Процедура ЗакрытиеЦенаФОТНачалоВыбора(Элемент, ДанныеВыбора, СтандартнаяОбработка)
	Стр = Элементы.Закрытие.ТекущиеДанные;
	
	мЦен  = мЦен( Объект.ПланРабот,  Стр.Номенклатура, "ЦенаФОТ" );
	Если мЦен <>  Неопределено Тогда
		ЭтаФорма.Элементы.ЗакрытиеЦенаФОТ.РежимВыбораИзСписка	=	Истина;
		ЭтаФорма.Элементы.ЗакрытиеЦенаФОТ.СписокВыбора.ЗагрузитьЗначения(мЦен);
	КонецЕсли;
КонецПроцедуры


//&НаКлиенте
//Процедура ЗакрытиеЦенаФОТПриИзменении(Элемент)
//	Стр = Элементы.Закрытие.ТекущиеДанные;
//	ПересчетСуммПоСтроке( Стр );
//КонецПроцедуры


&НаКлиенте
Процедура ЗакрытиеПриИзменении(Элемент)
	Стр = Элементы.Закрытие.ТекущиеДанные;
	ПересчетСуммПоСтроке( Стр );
КонецПроцедуры
